In [2]:
import duckdb
import pandas as pd

In [3]:
con = duckdb.connect("/Users/ameedahmed/Desktop/my_lambda_docker/star_schema_project/star_schema_project_folder/dev.duckdb")
df = con.sql("SELECT * FROM yellow_trip_entire_table").df()

In [12]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,Airport_fee,cbd_congestion_fee
0,1,2025-01-01 00:18:38,2025-01-01 00:26:59,1,1.60,1,N,229,237,1,10.0,3.5,0.5,3.00,0.0,1.0,18.00,2.5,0.0,0.0
1,1,2025-01-01 00:32:40,2025-01-01 00:35:13,1,0.50,1,N,236,237,1,5.1,3.5,0.5,2.02,0.0,1.0,12.12,2.5,0.0,0.0
2,1,2025-01-01 00:44:04,2025-01-01 00:46:01,1,0.60,1,N,141,141,1,5.1,3.5,0.5,2.00,0.0,1.0,12.10,2.5,0.0,0.0
3,2,2025-01-01 00:14:27,2025-01-01 00:20:01,3,0.52,1,N,244,244,2,7.2,1.0,0.5,0.00,0.0,1.0,9.70,0.0,0.0,0.0
4,2,2025-01-01 00:21:34,2025-01-01 00:25:06,3,0.66,1,N,244,116,2,5.8,1.0,0.5,0.00,0.0,1.0,8.30,0.0,0.0,0.0

In [13]:
df["improvement_surcharge"].unique()

array([ 1. , -1. ,  0. ,  0.3])

In [9]:
con.sql("select * from date_dim_table").df()

                      uniq_id  year  month  day
0        12025-01-01 00:18:38  2025      1    1
1        12025-01-01 00:32:40  2025      1    1
2        12025-01-01 00:44:04  2025      1    1
3        22025-01-01 00:14:27  2025      1    1
4        22025-01-01 00:21:34  2025      1    1
...                       ...   ...    ...  ...
3475221  22025-01-31 23:01:48  2025      1   31
3475222  22025-01-31 23:50:29  2025      1   31
3475223  22025-01-31 23:26:59  2025      1   31
3475224  22025-01-31 23:14:34  2025      1   31
3475225  22025-01-31 23:56:42  2025      1   31

[3475226 rows x 4 columns]

In [4]:
trip_df = con.sql("SELECT * from trip_information").df()
trip_df.head()

,uniq_id,payment_type,Pickup_Taxi_zone,Dropoff_Taxi_zone,payment_type_detail,RatecodeID,Region_Trip_Ended
0,12025-01-01 00:18:38,1,229,237,Credit Card,1,Standard Rate
1,12025-01-01 00:32:40,1,236,237,Credit Card,1,Standard Rate
2,12025-01-01 00:44:04,1,141,141,Credit Card,1,Standard Rate
3,22025-01-01 00:14:27,2,244,244,Cash,1,Standard Rate
4,22025-01-01 00:21:34,2,244,116,Cash,1,Standard Rate